"""виведіть на екран елементи лінійного масиву (заданий користувачем) у
зворотному порядку"""
import numpy as np  # імпорт бібліотеки numpy

while True:
    while True:
        try:
            x = int(input('Введіть кількість елементів: '))  # задаємо кількість елементів
            break
        except ValueError:  # перехоплення помилки, якщо х не число
            print('Введіть число')
    b = np.zeros(x, dtype=int)  # ініціалізуєм матрицю нулями,тип даних-інт
    u = []  # пустий список для вихідного масива
    for i in range(x):
        b[i] = int(input('Введіть елементи: '))  # вводим значення
    for k in range(x):
        l = b[x - 1 - k]  # присвоюємо елементи масива b з x елементів в зворотньому порядку
        u.append(l)  # добавляємо в список
    print(u)
