"""виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана
користувачем)."""
import numpy as np

while True:
    n, p = int(input('Введiть кількість рядків:  ')), int(
        input('Введіть кількість стовбців: '))  # вводимо розмірність матриці
    while n != 3 and p != 3:  # перевірка на розмірність 3 на 3
        n, p = int(input('Введіть кількість рядкiв:  ')), int(input('Введiть кількість стовбців: '))
    a = np.zeros((n, p), dtype=int)  # ініціалізуємо матрицю нулями і тип даних інт
    for i in range(n):  # проходимося по рядам
        for j in range(p):  # проходимося по стовбцям
            a[j, i] = int(input(f'A[{i + 1},{j + 1}]='))  # заповнюємо матрицю значеннями і транспонуємо її
    print('Транспонована матриця', a)
