"""у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0."""
import numpy as np

while True:
    n, p = int(input('Введіть кількість рядків:  ')), int(input('Введіть кількість стовбців: '))
    while n != 4 and p != 4:  # перевірка на розмірність 3 на 3
        n, p = int(input('Введіть кількість рядків:  ')), int(input('Введіть кількість стовбців: '))
    a = np.zeros((n, p), dtype=int)  # ініціалізуємо матрицю нулями,і тип даних інт
    for i in range(n):  # прохід по рядам
        for j in range(p):  # прохід по стовбцям
            a[i, j] = int(input(f'A[{i + 1},{j + 1}]='))  # заповнення матриці
    print(a)
    for i in range(n):  # прохід по рядам
        for j in range(p):  # прохід по стовбцям
            if a[i, j] < 0:  # якщо значення від'ємні, змінюємо на 0
                a[i, j] = 0
    print(a)
